In [6]:
# loading data using single node cluster / without cluster 
from dask.distributed import Client
import dask.dataframe as dd

In [7]:
# Connecting from client machine to dask scheduler 
dask_api_url = "tcp://44.216.130.200:8786"
client = Client(dask_api_url)
print("connected to dask cluster with webUI : ",client.dashboard_link)

connected to dask cluster with webUI :  http://44.216.130.200:8787/status

In [8]:
# find s3 data URL 
data_url = "s3://delvex-software-center/USGS/large_dataset.csv"

In [9]:
df = dd.read_csv(data_url, storage_options={"anon": True})
# passing storage_option to provide auth details

In [10]:
df.head()

   ID     Name  Age      City     Salary
0   1      Bob   33   Phoenix  104608.15
1   2  Charlie   25  New York   42922.03
2   3    Alice   55   Chicago   40155.43
3   4      Bob   18   Chicago   36625.62
4   5  Charlie   30   Houston  101225.42

In [11]:
# calculate avg salary by city 
avg_sal = df.groupby('City')['Salary'].mean()

In [12]:
avg_sal.compute()

City
Chicago        75034.949588
Houston        74985.787845
Los Angeles    75044.818046
New York       75170.690729
Phoenix        75158.256643
Name: Salary, dtype: float64

In [13]:
# printing aggregations of salaries like min , max , mean 
agg_sal = df.groupby('City')['Salary'].agg(['min','max','mean'])

In [14]:
agg_sal.compute()

                  min        max          mean
City
Phoenix      30000.17  119999.72  75158.256643
New York     30003.23  119993.78  75170.690729
Chicago      30006.56  119999.89  75034.949588
Houston      30000.02  119994.74  74985.787845
Los Angeles  30003.62  119992.94  75044.818046